app/Controllers/AdminController.php

SELECT *
FROM `tables`
---
    public function manageTables()
    {
        $tableModel = new ModelTable();

        $data['tables'] = $tableModel->findAll();