app/Controllers/MenuAdmin.php

    public function dashboard()
    {
        // Cek apakah pengguna sudah login
        // if (!session('isLoggedIn')) {
        //     return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu');
        // }

        // // Tampilkan halaman dashboard

        // return view('admin/dashMenu',);
        // Cek apakah pengguna sudah login
        if (!session('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu');
        }

        // Ambil data menu dari model
        $menus = $this->menuModel->findAll();
---
SELECT *
FROM `menu`

        $this->menuModel->insert($data);

        // Redirect ke halaman yang sesuai setelah berhasil menyimpan menu
        return redirect()->to('/menu')->with('success', 'Menu berhasil ditambahkan.');
---
SELECT *
FROM `menu`

    public function pesanan()
    {
        // Cek apakah pengguna sudah login
        // if (!session('isLoggedIn')) {
        //     return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu');
        // }

        // Tampilkan halaman pesanan
        $menus = $this->menuModel->findAll();
---
SELECT *
FROM `menu`

    public function editMenu($id)
    {
        // Cek apakah pengguna sudah login
        if (!session('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu');
        }

        // Ambil data menu berdasarkan ID
        $menu = $this->menuModel->find($id);
---
SELECT *
FROM `menu`
WHERE `menu`.`id` = '1'