app/Controllers/User.php

    public function menu()
    {
        $menuModel = new ModelMenu();
        // Ambil data menu berdasarkan kategori
        $data['sushiMenus'] = $menuModel->where('kategori', 'Sushi')->findAll();
        $data['sashimiMenus'] = $menuModel->where('kategori', 'Sashimi')->findAll();
        $data['chinmiMenus'] = $menuModel->where('kategori', 'Chinmi')->findAll();
        $data['udonMenus'] = $menuModel->where('kategori', 'Udon')->findAll();
        $data['drinksMenus'] = $menuModel->where('kategori', 'Drinks')->findAll();
---
SELECT *
FROM `menu`
WHERE `kategori` = 'Sushi'
SELECT *
FROM `menu`
WHERE `kategori` = 'Sashimi'
SELECT *
FROM `menu`
WHERE `kategori` = 'Chinmi'
SELECT *
FROM `menu`
WHERE `kategori` = 'Udon'
SELECT *
FROM `menu`
WHERE `kategori` = 'Drinks'

    public function selectTable()
    {
        $tableModel = new ModelTable();

        // Get inactive tables
        $inactiveTables = $tableModel->where('status', 'inactive')->findAll();
---
SELECT *
FROM `tables`
WHERE `status` = 'inactive'

    public function AddselecteMenu()
    {
        $session = session();
        $namaPembeli = $session->get('nama_pembeli');
        $tableNumber = $session->get('table_number');
        $menuModel = new ModelMenu();
        $menuId = $this->request->getPost('id');
        $quantity = $this->request->getPost('quantity');

        // Mengambil data menu berdasarkan ID
        $menu = $menuModel->find($menuId);
---
SELECT *
FROM `menu`
WHERE `menu`.`id` = '7'

    public function processPayment()
    {
        // Ambil data dari form pembayaran
        $namaPembeli = $this->request->getPost('nama_pembeli');
        $tableNumber = $this->request->getPost('table_number');
        $metodePembayaran = $this->request->getPost('metode_pembayaran');
        $jumlahUang = $this->request->getPost('jumlah_uang');

        // Hitung total harga dari session cart
        $cart = session()->get('cart') ?? [];
        $totalHarga = 0;
        foreach ($cart as $item) {
            $totalHarga += $item['harga'] * $item['jumlah'];
        }

        // Simpan data invoice ke database
        $modelPesanan = new ModelPesanan();
        $data = [
            'nama_pembeli' => $namaPembeli,
            'table_number' => $tableNumber,
            'metode_pembayaran' => $metodePembayaran,
            'jumlah_uang' => $jumlahUang,
            'status_pembayaran' => 'Belum Dibayar',
            'status_pesanan' => 'Belum Selesai',
            'total_harga' => $totalHarga
        ];
        $modelPesanan->createInvoice($data);
---
INSERT INTO `pesanan` (`nama_pembeli`, `table_number`, `nama_produk`, `harga`, `jumlah`) VALUES ('ayubayu', '1', 'Uden ufo', '50000', '8')