app/Models/ModelTable.php

UPDATE `tables` SET `status` = '1'
WHERE `tables`.`id` IN ('3')
---
    public function activateTable($tableNumber)
    {
        $this->update($tableNumber,['status' => '1'] );